OpenFOAM/cases/ico20860-fcyl10-c/system/blockMeshDict
FoamFile
{
	version 2.0;
	format ascii;
	class dictionary;
	object blockMeshDict;
}

convertToMeters 1.0;

vertices
(
	// Cross-section 0
	(0.000000e+00	0.000000e+00	0.000000e+00)	// 0
	(5.000000e-01	0.000000e+00	0.000000e+00)	// 1
	(3.061617e-17	5.000000e-01	0.000000e+00)	// 2
	(-5.000000e-01	6.123234e-17	0.000000e+00)	// 3
	(-9.184851e-17	-5.000000e-01	0.000000e+00)	// 4
	// Full circle

	// Cross-section 1
	(0.000000e+00	0.000000e+00	1.000000e+01)	// 5
	(5.000000e-01	0.000000e+00	1.000000e+01)	// 6
	(3.061617e-17	5.000000e-01	1.000000e+01)	// 7
	(-5.000000e-01	6.123234e-17	1.000000e+01)	// 8
	(-9.184851e-17	-5.000000e-01	1.000000e+01)	// 9
	// Full circle
);

blocks
(
	// Blocks section 0, i.e. cross-sections 0 to 1
	hex (0 5 6 1 0 5 7 2) (800 40 36) simpleGrading (1.0 0.025 1.0) // Block 0
	hex (0 5 7 2 0 5 8 3) (800 40 36) simpleGrading (1.0 0.025 1.0) // Block 1
	hex (0 5 8 3 0 5 9 4) (800 40 36) simpleGrading (1.0 0.025 1.0) // Block 2
	hex (0 5 9 4 0 5 6 1) (800 40 36) simpleGrading (1.0 0.025 1.0) // Block 3 (full circle)
);

edges
(
	// Cross-section 0
	arc 1 2 (3.535534e-01 3.535534e-01 0.000000e+00) // 1 to 2
	arc 2 3 (-3.535534e-01 3.535534e-01 0.000000e+00) // 2 to 3
	arc 3 4 (-3.535534e-01 -3.535534e-01 0.000000e+00) // 3 to 4
	arc 4 1 (3.535534e-01 -3.535534e-01 0.000000e+00) // 4 to 1 (full circle)

	// Cross-section 1
	arc 6 7 (3.535534e-01 3.535534e-01 1.000000e+01) // 6 to 7
	arc 7 8 (-3.535534e-01 3.535534e-01 1.000000e+01) // 7 to 8
	arc 8 9 (-3.535534e-01 -3.535534e-01 1.000000e+01) // 8 to 9
	arc 9 6 (3.535534e-01 -3.535534e-01 1.000000e+01) // 9 to 6 (full circle)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 2 1 0)
			(0 3 2 0)
			(0 4 3 0)
			(0 1 4 0)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			(5 6 7 5)
			(5 7 8 5)
			(5 8 9 5)
			(5 9 6 5)
		);
	}

	wall
	{
		type wall;
		faces
		(
			// Blocks section 0
			(1 2 7 6) // Block 0
			(2 3 8 7) // Block 1
			(3 4 9 8) // Block 2
			(4 1 6 9) // Block 3 (full circle)
		);
	}
);
